{"class_name": "Model", "keras_version": "2.0.6", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 512, 512, 3], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Lambda", "config": {"function": ["c\u0003\u0000\u0000\u0000\u0007\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000s~\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000\u0083\u0001\u0000}\u0003\u0000t\u0000\u0000j\u0002\u0000|\u0003\u0000d\u0001\u0000 |\u0002\u0000\u001a|\u0003\u0000d\u0001\u0000\u001fg\u0002\u0000d\u0002\u0000d\u0003\u0000\u0083\u0001\u0001}\u0004\u0000t\u0000\u0000j\u0002\u0000|\u0003\u0000d\u0001\u0000 |\u0002\u0000\u001a|\u0003\u0000d\u0001\u0000\u001fd\u0003\u0000\u0014g\u0002\u0000d\u0002\u0000d\u0003\u0000\u0083\u0001\u0001}\u0005\u0000|\u0005\u0000|\u0001\u0000\u0014}\u0006\u0000t\u0000\u0000j\u0003\u0000|\u0000\u0000|\u0006\u0000|\u0004\u0000\u0083\u0003\u0000S(\u0004\u0000\u0000\u0000Ni\u0001\u0000\u0000\u0000t\u0004\u0000\u0000\u0000axisi\u0000\u0000\u0000\u0000(\u0004\u0000\u0000\u0000t\u0002\u0000\u0000\u0000tft\u0005\u0000\u0000\u0000shapet\u0006\u0000\u0000\u0000concatt\u0005\u0000\u0000\u0000slice(\u0007\u0000\u0000\u0000t\u0004\u0000\u0000\u0000datat\u0003\u0000\u0000\u0000idxt\u0005\u0000\u0000\u0000partsR\u0002\u0000\u0000\u0000t\u0004\u0000\u0000\u0000sizet\u0006\u0000\u0000\u0000stridet\u0005\u0000\u0000\u0000start(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000sD\u0000\u0000\u0000/home/protein-structure-exploration-gpu/src/models/ParallelModels.pyt\t\u0000\u0000\u0000get_slice\t\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\u000f\u0001'\u0001+\u0001\n\u0001", null, null], "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {"parts": 7, "idx": 0}, "output_shape": [512, 512, 3], "output_shape_type": "raw"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "lambda_1"}, {"class_name": "Lambda", "config": {"function": ["c\u0003\u0000\u0000\u0000\u0007\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000s~\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000\u0083\u0001\u0000}\u0003\u0000t\u0000\u0000j\u0002\u0000|\u0003\u0000d\u0001\u0000 |\u0002\u0000\u001a|\u0003\u0000d\u0001\u0000\u001fg\u0002\u0000d\u0002\u0000d\u0003\u0000\u0083\u0001\u0001}\u0004\u0000t\u0000\u0000j\u0002\u0000|\u0003\u0000d\u0001\u0000 |\u0002\u0000\u001a|\u0003\u0000d\u0001\u0000\u001fd\u0003\u0000\u0014g\u0002\u0000d\u0002\u0000d\u0003\u0000\u0083\u0001\u0001}\u0005\u0000|\u0005\u0000|\u0001\u0000\u0014}\u0006\u0000t\u0000\u0000j\u0003\u0000|\u0000\u0000|\u0006\u0000|\u0004\u0000\u0083\u0003\u0000S(\u0004\u0000\u0000\u0000Ni\u0001\u0000\u0000\u0000t\u0004\u0000\u0000\u0000axisi\u0000\u0000\u0000\u0000(\u0004\u0000\u0000\u0000t\u0002\u0000\u0000\u0000tft\u0005\u0000\u0000\u0000shapet\u0006\u0000\u0000\u0000concatt\u0005\u0000\u0000\u0000slice(\u0007\u0000\u0000\u0000t\u0004\u0000\u0000\u0000datat\u0003\u0000\u0000\u0000idxt\u0005\u0000\u0000\u0000partsR\u0002\u0000\u0000\u0000t\u0004\u0000\u0000\u0000sizet\u0006\u0000\u0000\u0000stridet\u0005\u0000\u0000\u0000start(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000sD\u0000\u0000\u0000/home/protein-structure-exploration-gpu/src/models/ParallelModels.pyt\t\u0000\u0000\u0000get_slice\t\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\u000f\u0001'\u0001+\u0001\n\u0001", null, null], "name": "lambda_2", "trainable": true, "function_type": "lambda", "arguments": {"parts": 7, "idx": 1}, "output_shape": [512, 512, 3], "output_shape_type": "raw"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "lambda_2"}, {"class_name": "Lambda", "config": {"function": ["c\u0003\u0000\u0000\u0000\u0007\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000s~\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000\u0083\u0001\u0000}\u0003\u0000t\u0000\u0000j\u0002\u0000|\u0003\u0000d\u0001\u0000 |\u0002\u0000\u001a|\u0003\u0000d\u0001\u0000\u001fg\u0002\u0000d\u0002\u0000d\u0003\u0000\u0083\u0001\u0001}\u0004\u0000t\u0000\u0000j\u0002\u0000|\u0003\u0000d\u0001\u0000 |\u0002\u0000\u001a|\u0003\u0000d\u0001\u0000\u001fd\u0003\u0000\u0014g\u0002\u0000d\u0002\u0000d\u0003\u0000\u0083\u0001\u0001}\u0005\u0000|\u0005\u0000|\u0001\u0000\u0014}\u0006\u0000t\u0000\u0000j\u0003\u0000|\u0000\u0000|\u0006\u0000|\u0004\u0000\u0083\u0003\u0000S(\u0004\u0000\u0000\u0000Ni\u0001\u0000\u0000\u0000t\u0004\u0000\u0000\u0000axisi\u0000\u0000\u0000\u0000(\u0004\u0000\u0000\u0000t\u0002\u0000\u0000\u0000tft\u0005\u0000\u0000\u0000shapet\u0006\u0000\u0000\u0000concatt\u0005\u0000\u0000\u0000slice(\u0007\u0000\u0000\u0000t\u0004\u0000\u0000\u0000datat\u0003\u0000\u0000\u0000idxt\u0005\u0000\u0000\u0000partsR\u0002\u0000\u0000\u0000t\u0004\u0000\u0000\u0000sizet\u0006\u0000\u0000\u0000stridet\u0005\u0000\u0000\u0000start(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000sD\u0000\u0000\u0000/home/protein-structure-exploration-gpu/src/models/ParallelModels.pyt\t\u0000\u0000\u0000get_slice\t\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\u000f\u0001'\u0001+\u0001\n\u0001", null, null], "name": "lambda_3", "trainable": true, "function_type": "lambda", "arguments": {"parts": 7, "idx": 2}, "output_shape": [512, 512, 3], "output_shape_type": "raw"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "lambda_3"}, {"class_name": "Lambda", "config": {"function": ["c\u0003\u0000\u0000\u0000\u0007\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000s~\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000\u0083\u0001\u0000}\u0003\u0000t\u0000\u0000j\u0002\u0000|\u0003\u0000d\u0001\u0000 |\u0002\u0000\u001a|\u0003\u0000d\u0001\u0000\u001fg\u0002\u0000d\u0002\u0000d\u0003\u0000\u0083\u0001\u0001}\u0004\u0000t\u0000\u0000j\u0002\u0000|\u0003\u0000d\u0001\u0000 |\u0002\u0000\u001a|\u0003\u0000d\u0001\u0000\u001fd\u0003\u0000\u0014g\u0002\u0000d\u0002\u0000d\u0003\u0000\u0083\u0001\u0001}\u0005\u0000|\u0005\u0000|\u0001\u0000\u0014}\u0006\u0000t\u0000\u0000j\u0003\u0000|\u0000\u0000|\u0006\u0000|\u0004\u0000\u0083\u0003\u0000S(\u0004\u0000\u0000\u0000Ni\u0001\u0000\u0000\u0000t\u0004\u0000\u0000\u0000axisi\u0000\u0000\u0000\u0000(\u0004\u0000\u0000\u0000t\u0002\u0000\u0000\u0000tft\u0005\u0000\u0000\u0000shapet\u0006\u0000\u0000\u0000concatt\u0005\u0000\u0000\u0000slice(\u0007\u0000\u0000\u0000t\u0004\u0000\u0000\u0000datat\u0003\u0000\u0000\u0000idxt\u0005\u0000\u0000\u0000partsR\u0002\u0000\u0000\u0000t\u0004\u0000\u0000\u0000sizet\u0006\u0000\u0000\u0000stridet\u0005\u0000\u0000\u0000start(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000sD\u0000\u0000\u0000/home/protein-structure-exploration-gpu/src/models/ParallelModels.pyt\t\u0000\u0000\u0000get_slice\t\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\u000f\u0001'\u0001+\u0001\n\u0001", null, null], "name": "lambda_4", "trainable": true, "function_type": "lambda", "arguments": {"parts": 7, "idx": 3}, "output_shape": [512, 512, 3], "output_shape_type": "raw"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "lambda_4"}, {"class_name": "Lambda", "config": {"function": ["c\u0003\u0000\u0000\u0000\u0007\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000s~\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000\u0083\u0001\u0000}\u0003\u0000t\u0000\u0000j\u0002\u0000|\u0003\u0000d\u0001\u0000 |\u0002\u0000\u001a|\u0003\u0000d\u0001\u0000\u001fg\u0002\u0000d\u0002\u0000d\u0003\u0000\u0083\u0001\u0001}\u0004\u0000t\u0000\u0000j\u0002\u0000|\u0003\u0000d\u0001\u0000 |\u0002\u0000\u001a|\u0003\u0000d\u0001\u0000\u001fd\u0003\u0000\u0014g\u0002\u0000d\u0002\u0000d\u0003\u0000\u0083\u0001\u0001}\u0005\u0000|\u0005\u0000|\u0001\u0000\u0014}\u0006\u0000t\u0000\u0000j\u0003\u0000|\u0000\u0000|\u0006\u0000|\u0004\u0000\u0083\u0003\u0000S(\u0004\u0000\u0000\u0000Ni\u0001\u0000\u0000\u0000t\u0004\u0000\u0000\u0000axisi\u0000\u0000\u0000\u0000(\u0004\u0000\u0000\u0000t\u0002\u0000\u0000\u0000tft\u0005\u0000\u0000\u0000shapet\u0006\u0000\u0000\u0000concatt\u0005\u0000\u0000\u0000slice(\u0007\u0000\u0000\u0000t\u0004\u0000\u0000\u0000datat\u0003\u0000\u0000\u0000idxt\u0005\u0000\u0000\u0000partsR\u0002\u0000\u0000\u0000t\u0004\u0000\u0000\u0000sizet\u0006\u0000\u0000\u0000stridet\u0005\u0000\u0000\u0000start(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000sD\u0000\u0000\u0000/home/protein-structure-exploration-gpu/src/models/ParallelModels.pyt\t\u0000\u0000\u0000get_slice\t\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\u000f\u0001'\u0001+\u0001\n\u0001", null, null], "name": "lambda_5", "trainable": true, "function_type": "lambda", "arguments": {"parts": 7, "idx": 4}, "output_shape": [512, 512, 3], "output_shape_type": "raw"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "lambda_5"}, {"class_name": "Lambda", "config": {"function": ["c\u0003\u0000\u0000\u0000\u0007\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000s~\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000\u0083\u0001\u0000}\u0003\u0000t\u0000\u0000j\u0002\u0000|\u0003\u0000d\u0001\u0000 |\u0002\u0000\u001a|\u0003\u0000d\u0001\u0000\u001fg\u0002\u0000d\u0002\u0000d\u0003\u0000\u0083\u0001\u0001}\u0004\u0000t\u0000\u0000j\u0002\u0000|\u0003\u0000d\u0001\u0000 |\u0002\u0000\u001a|\u0003\u0000d\u0001\u0000\u001fd\u0003\u0000\u0014g\u0002\u0000d\u0002\u0000d\u0003\u0000\u0083\u0001\u0001}\u0005\u0000|\u0005\u0000|\u0001\u0000\u0014}\u0006\u0000t\u0000\u0000j\u0003\u0000|\u0000\u0000|\u0006\u0000|\u0004\u0000\u0083\u0003\u0000S(\u0004\u0000\u0000\u0000Ni\u0001\u0000\u0000\u0000t\u0004\u0000\u0000\u0000axisi\u0000\u0000\u0000\u0000(\u0004\u0000\u0000\u0000t\u0002\u0000\u0000\u0000tft\u0005\u0000\u0000\u0000shapet\u0006\u0000\u0000\u0000concatt\u0005\u0000\u0000\u0000slice(\u0007\u0000\u0000\u0000t\u0004\u0000\u0000\u0000datat\u0003\u0000\u0000\u0000idxt\u0005\u0000\u0000\u0000partsR\u0002\u0000\u0000\u0000t\u0004\u0000\u0000\u0000sizet\u0006\u0000\u0000\u0000stridet\u0005\u0000\u0000\u0000start(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000sD\u0000\u0000\u0000/home/protein-structure-exploration-gpu/src/models/ParallelModels.pyt\t\u0000\u0000\u0000get_slice\t\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\u000f\u0001'\u0001+\u0001\n\u0001", null, null], "name": "lambda_6", "trainable": true, "function_type": "lambda", "arguments": {"parts": 7, "idx": 5}, "output_shape": [512, 512, 3], "output_shape_type": "raw"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "lambda_6"}, {"class_name": "Lambda", "config": {"function": ["c\u0003\u0000\u0000\u0000\u0007\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000s~\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000\u0083\u0001\u0000}\u0003\u0000t\u0000\u0000j\u0002\u0000|\u0003\u0000d\u0001\u0000 |\u0002\u0000\u001a|\u0003\u0000d\u0001\u0000\u001fg\u0002\u0000d\u0002\u0000d\u0003\u0000\u0083\u0001\u0001}\u0004\u0000t\u0000\u0000j\u0002\u0000|\u0003\u0000d\u0001\u0000 |\u0002\u0000\u001a|\u0003\u0000d\u0001\u0000\u001fd\u0003\u0000\u0014g\u0002\u0000d\u0002\u0000d\u0003\u0000\u0083\u0001\u0001}\u0005\u0000|\u0005\u0000|\u0001\u0000\u0014}\u0006\u0000t\u0000\u0000j\u0003\u0000|\u0000\u0000|\u0006\u0000|\u0004\u0000\u0083\u0003\u0000S(\u0004\u0000\u0000\u0000Ni\u0001\u0000\u0000\u0000t\u0004\u0000\u0000\u0000axisi\u0000\u0000\u0000\u0000(\u0004\u0000\u0000\u0000t\u0002\u0000\u0000\u0000tft\u0005\u0000\u0000\u0000shapet\u0006\u0000\u0000\u0000concatt\u0005\u0000\u0000\u0000slice(\u0007\u0000\u0000\u0000t\u0004\u0000\u0000\u0000datat\u0003\u0000\u0000\u0000idxt\u0005\u0000\u0000\u0000partsR\u0002\u0000\u0000\u0000t\u0004\u0000\u0000\u0000sizet\u0006\u0000\u0000\u0000stridet\u0005\u0000\u0000\u0000start(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000sD\u0000\u0000\u0000/home/protein-structure-exploration-gpu/src/models/ParallelModels.pyt\t\u0000\u0000\u0000get_slice\t\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\u000f\u0001'\u0001+\u0001\n\u0001", null, null], "name": "lambda_7", "trainable": true, "function_type": "lambda", "arguments": {"parts": 7, "idx": 6}, "output_shape": [512, 512, 3], "output_shape_type": "raw"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "lambda_7"}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 512, 512, 3], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_1", "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_1"}, {"class_name": "Dropout", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"rate": 0.2, "trainable": true, "name": "dropout_1"}, "name": "dropout_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_2", "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_3", "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_3"}, {"class_name": "Dropout", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"rate": 0.2, "trainable": true, "name": "dropout_2"}, "name": "dropout_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_4", "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_4"}, {"class_name": "Dropout", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"rate": 0.2, "trainable": true, "name": "dropout_3"}, "name": "dropout_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_5", "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_5"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_6", "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_6"}, {"class_name": "Dropout", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"rate": 0.2, "trainable": true, "name": "dropout_4"}, "name": "dropout_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_7", "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_7"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_8", "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_8"}, {"class_name": "Dropout", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"rate": 0.2, "trainable": true, "name": "dropout_5"}, "name": "dropout_5"}, {"class_name": "Conv2D", "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_9", "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_9"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"name": "max_pooling2d_4", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_10", "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_10"}, {"class_name": "Dropout", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"rate": 0.2, "trainable": true, "name": "dropout_6"}, "name": "dropout_6"}, {"class_name": "Conv2D", "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_11", "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_11"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"name": "max_pooling2d_5", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d_5"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_12", "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_12"}, {"class_name": "Dropout", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"rate": 0.2, "trainable": true, "name": "dropout_7"}, "name": "dropout_7"}, {"class_name": "Conv2D", "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_13", "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_13"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"name": "max_pooling2d_6", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d_6"}, {"class_name": "Flatten", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1"}, {"class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1024, "use_bias": true, "activity_regularizer": null}, "name": "dense_1"}, {"class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"rate": 0.5, "trainable": true, "name": "dropout_8"}, "name": "dropout_8"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_8", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "name": "dense_2"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_2", 0, 0]]}, "inbound_nodes": [[["lambda_1", 0, 0, {}]], [["lambda_2", 0, 0, {}]], [["lambda_3", 0, 0, {}]], [["lambda_4", 0, 0, {}]], [["lambda_5", 0, 0, {}]], [["lambda_6", 0, 0, {}]], [["lambda_7", 0, 0, {}]]], "name": "model_1"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": 0, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["model_1", 1, 0, {"mask": [null, null, null, null, null, null, null]}], ["model_1", 2, 0, {"mask": [null, null, null, null, null, null, null]}], ["model_1", 3, 0, {"mask": [null, null, null, null, null, null, null]}], ["model_1", 4, 0, {"mask": [null, null, null, null, null, null, null]}], ["model_1", 5, 0, {"mask": [null, null, null, null, null, null, null]}], ["model_1", 6, 0, {"mask": [null, null, null, null, null, null, null]}], ["model_1", 7, 0, {"mask": [null, null, null, null, null, null, null]}]]], "name": "merge_1"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["merge_1", 0, 0]], "name": "model_2"}, "backend": "tensorflow"}